<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest SWITCHdrive installer and imports it into FileWave.</string>
	<key>Comment</key>
	<string>You'll need to add the repo containing the download recipe:
	autopkg repo-add https://github.com/ITS-Unibas/autopkg-recipes</string>
	<key>Identifier</key>
	<string>com.github.mihelm.autopkg.filewave.SWITCHdrive</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SWITCHdrive</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.its-unibas.download.switchdrive</string>
	<key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/expanded</string>
                <key>flat_pkg_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
		<dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/expanded/SWITCHdrive.pkg/Payload</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/Applications/SWITCHdrive.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
                <string>CFBundleVersion</string>
            </dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>com.github.mihelm.autopkg.filewave.SWITCHdrive</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
