<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download FreeMind disk image and build a package that includes the QuickLook
    plug-in.</string>
    <key>Identifier</key>
    <string>com.github.mihelm.autopkg.pkg.freemind</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FreeMind</string>
    </dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
    <key>ParentRecipe</key>
    <string>com.github.prochat.download.freemind</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>AppDmgVersioner</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                    <key>Library</key>
                    <string>0755</string>
                    <key>Library/QuickLook</key>
                    <string>0755</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/FreeMind.app</string>
                <key>destination_path</key>
                <string>%pkgroot%/Applications/FreeMind.app</string>
            </dict>
        </dict>
		<dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/FreemindQL.qlgenerator</string>
                <key>destination_path</key>
                <string>%pkgroot%/Library/QuickLook/FreemindQL.qlgenerator</string>
            </dict>
        </dict><dict>
        	<key>Processor</key>
         	<string>PkgCreator</string>
         	<key>Arguments</key>
         	<dict>
             	<key>pkgname</key>
             	<string>%NAME%-%dversion%</string>
                <key>version</key>
               	<string>%dversion%</string>
             	<key>pkg_request</key>
             	<dict>
                 	<key>pkgdir</key>
                 	<string>%RECIPE_CACHE_DIR%</string>
                 	<key>id</key>
                 	<string>%bundleid%</string>
                 	<key>options</key>
                 	<string>purge_ds_store</string>
                 	<key>chown</key>
                 	<array>
                     	<dict>
                         	<key>path</key>
                         	<string>Applications</string>
                         	<key>user</key>
                         	<string>root</string>
                         	<key>group</key>
                         	<string>admin</string>
                     	</dict>
                     	<dict>
                         	<key>path</key>
                         	<string>Library</string>
                         	<key>user</key>
                         	<string>root</string>
                         	<key>group</key>
                         	<string>wheel</string>
                     	</dict><dict>
                         	<key>path</key>
                         	<string>Library/QuickLook</string>
                         	<key>user</key>
                         	<string>root</string>
                         	<key>group</key>
                         	<string>wheel</string>
                     	</dict>
                 	</array>
             	</dict>
         	</dict>
     	</dict>
	</array>
</dict>
</plist>

