<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest updates for Acrobat Pro XI and imports it into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.mihelm.autopkg.filewave.AcrobatProXIUpdate</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>AdobeAcrobatProXI_Update</string>
		<key>MAJOR_VERSION</key>
        <string>11</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.download.AdobeAcrobatProXUpdate</string>
	<key>Process</key>
	<array>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>com.github.mihelm.autopkg.filewave.AcrobatProXIUpdate</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_fileset_name</key>
				<string>%pkg_name%</string>
				<key>fw_import_source</key>
				<string>%pkg_path%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
