<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the installer for the latest FileMaker Pro 14 Updater and imports
    it into FileWave.</string>
	<key>Comment</key>
	<string>This recipe only imports the updater for FileMaker Pro 14 into FileWave. It
    can be adapted to import the updater for Pro Advanced instead. The updater needs to
    be installed over a base install. com.github.bradclare.download.filemakerpro14 can
    provide this with a manual run and manual import.</string>
	<key>Identifier</key>
	<string>com.github.mihelm.autopkg.filewave.FileMakerPro14Updater</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>FileMaker Pro 14 Updater</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.mihelm.autopkg.filewave.FileMakerPro14Updater</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.ygini.download.FileMaker14Updater</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>PkgCopier</string>
			<key>Arguments</key>
			<dict>
				<key>source_pkg</key>
				<string>%pathname%/*.pkg</string>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%url_version_number%.pkg</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_version</key>
				<string>%url_version_number%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %url_version_number%</string>
				<key>fw_import_source</key>
				<string>%pkg_path%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
