<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of StuffIt Expander 16 and imports it into FileWave.
    For instructions on how the App Store recipes work, please consult:
    https://github.com/autopkg/nmcspadden-recipes</string>
	<key>Identifier</key>
	<string>com.github.mihelm.autopkg.filewave.StuffItExpander16</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>StuffIt Expander 16</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.mihelm.autopkg.filewave.StuffItExpander16</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.2</string>
	<key>ParentRecipe</key>
	<string>com.github.nmcspadden.pkg.appstore</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%pkg_path%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
