<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest MenuMeters zip archive, creates a pkg and uploads it to the
    FileWave Server. Doesn't use the original release from Raging Menace, but rather the
    upwards compatible fork by yujitach.</string>
	<key>Identifier</key>
	<string>com.github.mihelm.autopkg.filewave.MenuMeters</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>MenuMeters</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.2</string>
	<key>ParentRecipe</key>
	<string>com.github.mihelm.autopkg.pkg.MenuMeters</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%pkg_path%</string>
				<key>fw_app_bundle_id</key>
				<string>%BUNDLE_ID%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
