<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest patch for Adobe Reader and imports it into FileWave.
    This recipe only provides the most recent update. You are going to need the full
    installer for 11.0.10 as a base install. There is a download recipe you can use for 
    that. And since this is Adobe, it's not as simple as just installing the most recent
    patch over the base install. The 11.0.15 patch for instance was just a security
    update and couldn't be installed on top of 11.0.10. In that particular case you first
    needed to install the patch for 11.0.14. The download link provided by this recipe's
    parent recipe can be adapted in a browser to get at previous patches.</string>
	<key>Identifier</key>
	<string>com.github.mihelm.autopkg.filewave.AdobeReaderUpdates</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Adobe Reader Update</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.download.AdobeReaderUpdates</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>com.github.mihelm.autopkg.filewave.AdobeReaderUpdates</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
